Documents/ПлановоеПогашениеЗадолженностиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПлановоеПогашениеЗадолженностиСотрудников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияВозвратаЗадолженности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Comment>АПК:58 Период регистрации - месяц</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Задолженности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументОснованиеЗарплатыКВыплате</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОграничения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособОграниченияВыплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/УсловияВозвратаЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УсловияВозвратаЗадолженности</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОграничения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОграниченияВыплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеЗарплатыКВыплате</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПлановоеПогашениеЗадолженностиСотрудников/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Для Каждого Задолженность Из Задолженности Цикл
		
		УсловияВозвратаЗадолженности = Движения.УсловияВозвратаЗадолженности.Добавить();
		ЗаполнитьЗначенияСвойств(УсловияВозвратаЗадолженности, Задолженность);
		УсловияВозвратаЗадолженности.Период = ПериодРегистрации;
		
	КонецЦикла;
	
	Движения.УсловияВозвратаЗадолженности.Записывать = Истина;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СотрудникиПериоды = Задолженности.Выгрузить(, "НомерСтроки, Сотрудник, ДокументОснование");
	СотрудникиПериоды.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));		
	СотрудникиПериоды.ЗаполнитьЗначения(ПериодРегистрации, "Период");
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("СотрудникиПериоды", СотрудникиПериоды);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиПериоды.НомерСтроки КАК НомерСтроки,
		|	СотрудникиПериоды.Период КАК Период,
		|	СотрудникиПериоды.Сотрудник КАК Сотрудник,
		|	СотрудникиПериоды.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТСотрудникиПериоды
		|ИЗ
		|	&СотрудникиПериоды КАК СотрудникиПериоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудникиПериоды.НомерСтроки КАК НомерСтроки,
		|	ВТСотрудникиПериоды.Период КАК Период,
		|	ПРЕДСТАВЛЕНИЕ(ВТСотрудникиПериоды.Сотрудник) КАК СотрудникПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВТСотрудникиПериоды.ДокументОснование) КАК ДокументОснованиеПредставление,
		|	ПРЕДСТАВЛЕНИЕ(УсловияВозвратаЗадолженности.Регистратор) КАК РегистраторПредставление
		|ИЗ
		|	ВТСотрудникиПериоды КАК ВТСотрудникиПериоды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияВозвратаЗадолженности КАК УсловияВозвратаЗадолженности
		|		ПО ВТСотрудникиПериоды.Период = УсловияВозвратаЗадолженности.Период
		|			И ВТСотрудникиПериоды.Сотрудник = УсловияВозвратаЗадолженности.Сотрудник
		|			И ВТСотрудникиПериоды.ДокументОснование = УсловияВозвратаЗадолженности.ДокументОснование
		|			И (УсловияВозвратаЗадолженности.Регистратор <> &Регистратор)";
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			                                                                 
			ТекстСообщения = НСтр("ru='Сотруднику %1 по документу-основанию ""%2"" в текущем периоде уже назначено плановое погашение документом %3.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.СотрудникПредставление, Выборка.ДокументОснованиеПредставление, Выборка.РегистраторПредставление);
			
			ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения,
			Ссылка,
			"Сотрудники[" + Формат(Выборка.НомерСтроки - 1, "ЧГ=") + "].Сотрудник",
			"Объект",
			Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	                                                                                                              
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Автозаполнение() Экспорт

	ПравилаПроверки = Новый Структура;
	ПравилаПроверки.Вставить("ПериодРегистрации",	НСтр("ru='Не указан период регистрации'"));
	ПравилаПроверки.Вставить("Организация",			НСтр("ru='Не выбрана организация'"));

	Если ЗарплатаКадры.СвойстваЗаполнены(ЭтотОбъект, ПравилаПроверки) Тогда
		
		ЗадолженностиСотрудников = Документы.ПлановоеПогашениеЗадолженностиСотрудников.ЗадолженностиСотрудников(ЭтотОбъект.Ссылка, Организация, КонецМесяца(ПериодРегистрации));
		Задолженности.Загрузить(ЗадолженностиСотрудников);
		
		Если Задолженности.Количество() = 0 Тогда
			
			ТекстСообщения = НСтр("ru = 'Не найдены сотрудники с задолженностью.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект);	
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов   объекта на клиенте.'");
#КонецЕсли
